app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
      @boo = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
      @show = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "本をたくさん"], ["body", "読んだけど\r\n"], ["updated_at", "2018-05-20 11:52:25.178407"], ["id", 1]]
---
  def update
       book = Book.find(params[:id])
       book.update(book_params)

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "sss"], ["body", "sss"], ["created_at", "2018-05-18 04:43:36.360172"], ["updated_at", "2018-05-18 04:43:36.360172"], ["user_id", 1]]
---
  def create
      book = Book.new(book_params)
      if book.save